#### Name : Stuti Upadhyay
#### Campus ID : XT81177
#### Instructor : Chalachew Jemberie

# Pandas Exercises

Time to test your new pandas skills! Use the two csv files in this folder to complete the tasks in bold below!

** NOTE: ALL TASKS MUST BE DONE IN ONE LINE OF PANDAS CODE.

** Import pandas and read in the banklist.csv file into a dataframe called banks. **

In [1]:
import pandas as pd
df = pd.read_csv("banklist.csv")

In [2]:
df

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
...,...,...,...,...,...,...,...
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

** Show the head of the dataframe **

In [3]:
# CODE HERE

In [4]:
df.head(5)

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

** What are the column names? **

In [5]:
# CODE HERE

In [6]:
df.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

** How many States (ST) are represented in this data set? **

In [7]:
# CODE HERE

In [8]:
len(df['ST'].unique())

44

** Get a list or array of all the states in the data set. **

In [9]:
# CODE HERE

In [10]:
states_array = df['ST'].unique()
states_array

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

** What are the top 5 states with the most failed banks? **

In [11]:
# CODE HERE

In [12]:
df['ST'].value_counts().head()

ST
GA    93
FL    75
IL    67
CA    41
MN    23
Name: count, dtype: int64

** What are the top 5 acquiring institutions? **

In [13]:
# CODE HERE

In [14]:
df['Acquiring Institution'].value_counts().head()

Acquiring Institution
No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: count, dtype: int64

** How many banks has the State Bank of Texas acquired? How many of them were actually in Texas?**

In [15]:
# CODE HERE

In [16]:
df[df['Acquiring Institution'] == 'State Bank of Texas']['ST'].value_counts()

ST
IL    2
TX    1
Name: count, dtype: int64

** What is the most common city in California for a bank to fail in?**

In [17]:
# CODE HERE

In [18]:
df[df['ST'] == 'CA']['City'].value_counts().idxmax()

'Los Angeles'

** How many failed banks don't have the word "Bank" in their name? **

In [19]:
# CODE HERE

In [20]:
df[~df['Bank Name'].str.contains('Bank', na=False)].shape[0]

14

** How many bank names start with the letter 's' ? **

In [21]:
# CODE HERE

In [22]:
df[df['Bank Name'].str.startswith('S', na=False)].shape[0]

53

** How many CERT values are above 20000 ? **

In [23]:
# CODE HERE

In [24]:
df[df['CERT'] > 20000].shape[0]

417

** How many bank names consist of just two words? (e.g. "First Bank" , "Bank Georgia" )**

In [25]:
# CODE HERE

In [26]:
df[df['Bank Name'].apply(lambda x: len(x.split()) == 2)].shape[0]

114

**Bonus: How many banks closed in the year 2008? (remeber about time series with pandas yet! Feel free to check your notes!**

In [27]:
# CODE HERE

In [28]:
df['Closing Date'] = pd.to_datetime(df['Closing Date'])
df[df['Closing Date'].dt.year == 2008].shape[0]

/var/folders/s9/w1f1my553ll2rpzvjc_kqfx80000gn/T/ipykernel_85576/577650642.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  df['Closing Date'] = pd.to_datetime(df['Closing Date'])

25

# GREAT JOB!